results/5k-direct.txt
/ # wrk -t 4 -c 100 -d 60s -R 5000 --latency -s /req-body.lua http://localhost:1980/v1/cha
t/completions
Running 1m test @ http://localhost:1980/v1/chat/completions
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.132ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.866ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.832ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  456.34us   4.98ms   65.71%
    Req/Sec     1.34k   655.75     2.78k    75.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.25ms
 90.000%    1.53ms
 99.000%    2.01ms
 99.900%    2.76ms
 99.990%    4.08ms
 99.999%    4.60ms
100.000%    4.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.047     0.000000            1         1.00
       0.336     0.100000        25051         1.11
       0.514     0.200000        49936         1.25
       0.660     0.300000        74916         1.43
       0.799     0.400000        99846         1.67
       0.934     0.500000       124848         2.00
       0.998     0.550000       137156         2.22
       1.063     0.600000       149669         2.50
       1.127     0.650000       162170         2.86
       1.189     0.700000       174632         3.33
       1.254     0.750000       187133         4.00
       1.289     0.775000       193288         4.44
       1.329     0.800000       199544         5.00
       1.374     0.825000       205847         5.71
       1.422     0.850000       212011         6.67
       1.476     0.875000       218233         8.00
       1.504     0.887500       221310         8.89
       1.535     0.900000       224458        10.00
       1.569     0.912500       227609        11.43
       1.605     0.925000       230719        13.33
       1.647     0.937500       233779        16.00
       1.671     0.943750       235377        17.78
       1.697     0.950000       236933        20.00
       1.726     0.956250       238484        22.86
       1.758     0.962500       240017        26.67
       1.796     0.968750       241582        32.00
       1.816     0.971875       242348        35.56
       1.838     0.975000       243132        40.00
       1.863     0.978125       243906        45.71
       1.893     0.981250       244688        53.33
       1.928     0.984375       245470        64.00
       1.948     0.985938       245856        71.11
       1.971     0.987500       246241        80.00
       1.997     0.989062       246631        91.43
       2.026     0.990625       247025       106.67
       2.059     0.992188       247418       128.00
       2.079     0.992969       247616       142.22
       2.103     0.993750       247809       160.00
       2.133     0.994531       248000       182.86
       2.175     0.995313       248198       213.33
       2.215     0.996094       248389       256.00
       2.249     0.996484       248480       284.44
       2.283     0.996875       248579       320.00
       2.327     0.997266       248674       365.71
       2.383     0.997656       248770       426.67
       2.457     0.998047       248868       512.00
       2.503     0.998242       248918       568.89
       2.559     0.998437       248966       640.00
       2.629     0.998633       249014       731.43
       2.695     0.998828       249062       853.33
       2.765     0.999023       249111      1024.00
       2.829     0.999121       249135      1137.78
       2.877     0.999219       249160      1280.00
       2.939     0.999316       249185      1462.86
       3.031     0.999414       249209      1706.67
       3.149     0.999512       249233      2048.00
       3.177     0.999561       249245      2275.56
       3.245     0.999609       249258      2560.00
       3.323     0.999658       249269      2925.71
       3.445     0.999707       249281      3413.33
       3.597     0.999756       249295      4096.00
       3.647     0.999780       249300      4551.11
       3.707     0.999805       249306      5120.00
       3.769     0.999829       249312      5851.43
       3.805     0.999854       249318      6826.67
       3.905     0.999878       249324      8192.00
       4.021     0.999890       249327      9102.22
       4.099     0.999902       249330     10240.00
       4.111     0.999915       249333     11702.86
       4.155     0.999927       249336     13653.33
       4.239     0.999939       249339     16384.00
       4.299     0.999945       249341     18204.44
       4.303     0.999951       249342     20480.00
       4.323     0.999957       249344     23405.71
       4.351     0.999963       249345     27306.67
       4.367     0.999969       249347     32768.00
       4.439     0.999973       249348     36408.89
       4.439     0.999976       249348     40960.00
       4.447     0.999979       249349     46811.43
       4.451     0.999982       249350     54613.33
       4.459     0.999985       249351     65536.00
       4.459     0.999986       249351     72817.78
       4.459     0.999988       249351     81920.00
       4.599     0.999989       249352     93622.86
       4.599     0.999991       249352    109226.67
       4.711     0.999992       249353    131072.00
       4.711     0.999993       249353    145635.56
       4.711     0.999994       249353    163840.00
       4.711     0.999995       249353    187245.71
       4.711     0.999995       249353    218453.33
       4.987     0.999996       249354    262144.00
       4.987     1.000000       249354          inf
#[Mean    =        0.940, StdDeviation   =        0.456]
#[Max     =        4.984, Total count    =       249354]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  298559 requests in 1.00m, 135.82MB read
Requests/sec:   4975.85
Transfer/sec:      2.26MB