results/5k-gateway.txt
wrk -t 4 -c 100 -d 60s -R 5000 --latency -s /req-body.lua http://localhost:9080/v1/chat/completions
Running 1m test @ http://localhost:9080/v1/chat/completions
  4 threads and 100 connections
  Thread calibration: mean lat.: 2526.239ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 2662.220ms, rate sampling interval: 8847ms
  Thread calibration: mean lat.: 2559.460ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2559.460ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2531.646ms, rate sampling interval: 9215ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.69s     7.21s   30.23s    58.64%
    Req/Sec   625.10     17.70   669.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.12s 
 75.000%   23.81s 
 90.000%   27.54s 
 99.000%   29.64s 
 99.900%   30.05s 
 99.990%   30.18s 
 99.999%   30.23s 
100.000%   30.24s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4706.303     0.000000            1         1.00
    7376.895     0.100000        12541         1.11
   10158.079     0.200000        25064         1.25
   12902.399     0.300000        37592         1.43
   15581.183     0.400000        50138         1.67
   18120.703     0.500000        62705         2.00
   19185.663     0.550000        69011         2.22
   20283.391     0.600000        75222         2.50
   21463.039     0.650000        81494         2.86
   22757.375     0.700000        87767         3.33
   23805.951     0.750000        93983         4.00
   24346.623     0.775000        97141         4.44
   24952.831     0.800000       100304         5.00
   25608.191     0.825000       103452         5.71
   26230.783     0.850000       106579         6.67
   26886.143     0.875000       109671         8.00
   27230.207     0.887500       111277         8.89
   27541.503     0.900000       112780        10.00
   27852.799     0.912500       114382        11.43
   28147.711     0.925000       115969        13.33
   28426.239     0.937500       117476        16.00
   28573.695     0.943750       118297        17.78
   28704.767     0.950000       119032        20.00
   28852.223     0.956250       119836        22.86
   28999.679     0.962500       120671        26.67
   29130.751     0.968750       121407        32.00
   29196.287     0.971875       121792        35.56
   29261.823     0.975000       122170        40.00
   29343.743     0.978125       122648        45.71
   29409.279     0.981250       123011        53.33
   29474.815     0.984375       123359        64.00
   29523.967     0.985938       123592        71.11
   29556.735     0.987500       123746        80.00
   29605.887     0.989062       123966        91.43
   29655.039     0.990625       124161       106.67
   29704.191     0.992188       124338       128.00
   29736.959     0.992969       124450       142.22
   29769.727     0.993750       124556       160.00
   29786.111     0.994531       124612       182.86
   29835.263     0.995313       124757       213.33
   29868.031     0.996094       124839       256.00
   29884.415     0.996484       124878       284.44
   29900.799     0.996875       124917       320.00
   29917.183     0.997266       124959       365.71
   29949.951     0.997656       125030       426.67
   29966.335     0.998047       125060       512.00
   29982.719     0.998242       125087       568.89
   29999.103     0.998437       125115       640.00
   30015.487     0.998633       125136       731.43
   30031.871     0.998828       125157       853.33
   30048.255     0.999023       125179      1024.00
   30064.639     0.999121       125197      1137.78
   30064.639     0.999219       125197      1280.00
   30081.023     0.999316       125214      1462.86
   30097.407     0.999414       125231      1706.67
   30113.791     0.999512       125249      2048.00
   30113.791     0.999561       125249      2275.56
   30113.791     0.999609       125249      2560.00
   30130.175     0.999658       125262      2925.71
   30130.175     0.999707       125262      3413.33
   30146.559     0.999756       125271      4096.00
   30146.559     0.999780       125271      4551.11
   30146.559     0.999805       125271      5120.00
   30162.943     0.999829       125279      5851.43
   30162.943     0.999854       125279      6826.67
   30162.943     0.999878       125279      8192.00
   30179.327     0.999890       125287      9102.22
   30179.327     0.999902       125287     10240.00
   30179.327     0.999915       125287     11702.86
   30179.327     0.999927       125287     13653.33
   30179.327     0.999939       125287     16384.00
   30195.711     0.999945       125289     18204.44
   30195.711     0.999951       125289     20480.00
   30195.711     0.999957       125289     23405.71
   30212.095     0.999963       125292     27306.67
   30212.095     0.999969       125292     32768.00
   30212.095     0.999973       125292     36408.89
   30212.095     0.999976       125292     40960.00
   30212.095     0.999979       125292     46811.43
   30212.095     0.999982       125292     54613.33
   30228.479     0.999985       125293     65536.00
   30228.479     0.999986       125293     72817.78
   30228.479     0.999988       125293     81920.00
   30228.479     0.999989       125293     93622.86
   30228.479     0.999991       125293    109226.67
   30244.863     0.999992       125294    131072.00
   30244.863     1.000000       125294          inf
#[Mean    =    17685.551, StdDeviation   =     7205.163]
#[Max     =    30228.480, Total count    =       125294]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149451 requests in 1.00m, 71.41MB read
Requests/sec:   2490.62
Transfer/sec:      1.19MB